<?php 

echo '<h2>Домашняя работа по теме 03: Ассоциативные массивы </h2>';

$author_book = array(
            "Рей Брэдбери" => array("451° по Фаренгейту", "Вино из одуванчиков"), 
            "Грегори Дэвид Робертс" => array("Шантарам", "Тень горы"),
			"Джордж Оруэлл" => "1984", 
			"Михаил Афанасьевич Булгаков" => "Мастер и Маргарита", 
			"Эрих Мария Ремарк" => "Три товарища", 
			"Оскар Уайльд" => "Портрет Дориана Грея", 
			"Даниел Киз" => "Цветы для Элджернона", 
			"Джером Д. Сэлинджер" => "Над пропастью во ржи", 
			"Антуан де Сент-Экзюпери" => "Маленький принц", 
			"Лев Толстой" => "Анна Каренина", 
			"Габриэль Гарсиа Маркес" => "Сто лет одиночества", 
			"Айн Рэнд" => "Атлант расправил плечи"
		);
//echo "<pre>";
//print_r($author_book);
//echo "</pre>";

// echo $author_book["Айн Рэнд"];

print_r($author_book);
echo "<hr>";

foreach ($author_book as $key => $value) {
    if (is_array($value)) {
        foreach ($value as $val) {
            echo "$key => $val <br>";
        }
    }
    else {
        echo "$key => $value <br>";
    }
}

echo "<hr>";

foreach ($author_book as $key => $value) {
    if (is_array($value)) {
        foreach ($value as $val) {
        echo "Автор: $key  <br>";
        echo "книга: $val <br><br>";
        }
    }
    else {
        echo "Автор: $key  <br>";
        echo "книга: $value <br><br>";
    }
}


?>