<?php 
echo '<h2>Домашняя работа по теме 02: Основы PHP. Массивы</h2>';

$listBook = array("451° по Фаренгейту", "Шантарам", "1984", "Мастер и Маргарита", "Три товарища", "Портрет Дориана Грея", "Вино из одуванчиков", "Цветы для Элджернона", "Над пропастью во ржи", "Маленький принц", "Анна Каренина", "Сто лет одиночества", "Тень горы", "Атлант расправил плечи");
print_r($listBook);

echo "<ol>";
for ($i = 0; $i < count($listBook); $i++ ) {
	echo "<li> $listBook[$i] </li>";
}
echo "</ol>";

 ?>